var store = [{
"title": "祝贺刁明轩、丁正枫、王雨辰在“第八届全国大学生计算机系统能力培养大赛（龙芯杯）”取得佳绩",
"excerpt":"全国大学生计算机系统能力培养大赛（龙芯杯）是由系统能力培养研究专家组和系统能力培养示范高校共同发起，以学科竞赛推动专业建设和计算机领域创新人才培养体系改革、培育我国高端芯片及核心系统的技术突破与产业化后备人才为目标，面向高校大学生举办的全国性大赛。   第八届全国大学生计算机系统能力培养大赛（龙芯杯）分为团体赛和个人赛两项赛事。团队赛共 110 支队伍报名，个人赛共 782 人报名。经过初赛的激烈角逐，全国共有 28 支代表队和 40 位个人进入决赛。    决赛合影   在个人赛方面，刁明轩同学设计了基于 MIPS 指令集的 32 位单发射五级流水线 CPU。初赛中，该作品可以通过三级功能测试和性能测试，时钟频率可以稳定运行在 58MHz。现场决赛阶段，刁明轩同学顺利完成了现场汇编代码的编写，最终获得龙芯杯个人赛三等奖。    个人赛颁奖（左五：刁明轩）   在团队赛方面，北科队伍 tesserae of tantalus（成员：丁正枫、王雨辰、赖烁喆、张卓立）实现了一个六级流水顺序双发射的处理器软核，同时实现了分支预测，指令数据缓存，TLB 等模块，可以顺利启动经典的 bootloader 并完成指定功能。    团队赛决赛现场（从左到右：王雨辰、赖烁喆、丁正枫）   现场决赛阶段，经过团队指令集答题，汇编代码编写，团队答辩等环节的重重考验，最终获得全国二等奖，实现了我校在该项赛事成绩的新突破。    团队赛颁奖   获奖证书：    个人赛三等奖    团队赛二等奖  ","categories": [],
"tags": [],
"url": "/news/2024/10/lxb/",
"teaser": null
},{
"title": "祝贺刁明轩、丁正枫、王雨辰在“第八届全国大学生计算机系统能力培养大赛（龙芯杯）”取得佳绩",
"excerpt":"全国大学生计算机系统能力培养大赛（龙芯杯）是由系统能力培养研究专家组和系统能力培养示范高校共同发起，以学科竞赛推动专业建设和计算机领域创新人才培养体系改革、培育我国高端芯片及核心系统的技术突破与产业化后备人才为目标，面向高校大学生举办的全国性大赛。   第八届全国大学生计算机系统能力培养大赛（龙芯杯）分为团体赛和个人赛两项赛事。团队赛共 110 支队伍报名，个人赛共 782 人报名。经过初赛的激烈角逐，全国共有 28 支代表队和 40 位个人进入决赛。    决赛合影   在个人赛方面，刁明轩同学设计了基于 MIPS 指令集的 32 位单发射五级流水线 CPU。初赛中，该作品可以通过三级功能测试和性能测试，时钟频率可以稳定运行在 58MHz。现场决赛阶段，刁明轩同学顺利完成了现场汇编代码的编写，最终获得龙芯杯个人赛三等奖。    个人赛颁奖（左五：刁明轩）   在团队赛方面，北科队伍 tesserae of tantalus（成员：丁正枫、王雨辰、赖烁喆、张卓立）实现了一个六级流水顺序双发射的处理器软核，同时实现了分支预测，指令数据缓存，TLB 等模块，可以顺利启动经典的 bootloader 并完成指定功能。    团队赛决赛现场（从左到右：王雨辰、赖烁喆、丁正枫）   现场决赛阶段，经过团队指令集答题，汇编代码编写，团队答辩等环节的重重考验，最终获得全国二等奖，实现了我校在该项赛事成绩的新突破。    团队赛颁奖   获奖证书：    个人赛三等奖    团队赛二等奖  ","categories": [],
"tags": [],
"url": "/news/2024/10/lxb/",
"teaser": null
},{
"title": "联系我们",
"excerpt":"官方邮件地址   806@ustb.edu.cn   您可以向我们直接发送电子邮件。如需联系 806 负责人，请转至「负责人」页面。   无特殊情况时，请不要单独联系负责人。  ","categories": [],
"tags": [],
"url": "/wiki/806/contact/",
"teaser": null
},{
"title": "加入 806",
"excerpt":"806 会在每学年的秋季学期进行较大规模的招新，具体情况请关注 806 新闻以及校内的各个渠道。   对于能力较强的同学，通过 806 学长学姐的邀请，经过负责人认可后，也可以随时加入 806。   对于加入 806 后却不活跃的同学，806 有权利随时进行清退。  ","categories": [],
"tags": [],
"url": "/wiki/806/contribute/",
"teaser": null
},{
"title": "友情链接",
"excerpt":"   北京科技大学   中国科学技术大学   中国科学技术大学 Linux 用户协会  ","categories": [],
"tags": [],
"url": "/wiki/806/links/",
"teaser": null
},{
"title": "806 负责人",
"excerpt":" ","categories": [],
"tags": [],
"url": "/wiki/806/person-in-charge/",
"teaser": null
},{
"title": "添加文章",
"excerpt":"若需要在 806 官网上添加文章（新闻、博客、……)，请严格遵循以下步骤：           告知所在部门的负责人并经过其同意            fork 本仓库，配置环境并按照格式编写文章（请注意不同类型的文章的编写要求）                       添加新闻请在 /pages/_news 目录下按照年份分类添加                        添加博客请在 /pages/_blogs 目录下添加                        格式化代码（否则将无法通过代码审查）            在本网站的 GitHub 仓库提交一个 pull request            待负责人审查通过后合并进 main 分支，完成更新      ","categories": [],
"tags": [],
"url": "/wiki/doc/add-new-post/",
"teaser": null
},{
"title": "提问的智慧",
"excerpt":"How To Ask Questions The Smart Way Copyright © 2001,2006,2014 Eric S. Raymond, Rick Moen 本指南英文版版权为 Eric S. Raymond, Rick Moen 所有。 原文网址：http://www.catb.org/~esr/faqs/smart-questions.html 中文翻译仓库网址：https://github.com/ryanhanwu/How-To-Ask-Questions-The-Smart-Way。以下内容来自简体中文版。 Copyleft 2001 by D.H.Grand(nOBODY/Ginux), 2010 by Gasolin, 2015 by Ryan Wu 本中文指南是基于原文 3.10 版以及 2010 年由 Gasolin 所翻译版本的最新翻译； 协助指出翻译问题，请发 issue，或直接发 pull request 给我。 本文另有繁體中文版。 原文版本历史 声明...","categories": [],
"tags": [],
"url": "/wiki/doc/smart-questions/",
"teaser": null
},{
"title": "北京科技大学「勤敏轩」学生创新实验室",
"excerpt":"北京科技大学「勤敏轩」学生创新实验室是北京科技大学计算机与通信工程学院下属的本科生实验室，位于机电信息楼 806 室，简称「806 实验室」。   806 实验室全部成员皆为在校本科生，主要关注于各类高含金量的计算机专业学科竞赛，以及创新创业竞赛。   了解更多   联系我们      官方邮箱：806@ustb.edu.cn   实验室地址：北京科技大学本部机电信息楼 806 室   了解更多  ","categories": [],
"tags": [],
"url": "/wiki/",
"teaser": null
},{
"title": "北京科技大学「勤敏轩」学生创新实验室",
"excerpt":"关于我们   北京科技大学「勤敏轩」学生创新实验室是北京科技大学计算机与通信工程学院下属的本科生实验室，位于机电信息楼 806 室，简称「806 实验室」。   806 实验室全部成员皆为在校本科生，主要关注于各类高含金量的计算机专业学科竞赛，以及创新创业竞赛。   806 目前下设三个部门，分别为系统部、人工智能部和游戏部。   实验室标志   LOGO      牌匾      更多信息      联系方式  ","categories": [],
"tags": [],
"url": "/wiki/intro/",
"teaser": null
}]